---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetBarModelDiameter
source: html/990c08e9-0307-be15-15cf-49d39b942d4c.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetBarModelDiameter Method

Gets the model diameter of the Rebar.

## Syntax (C#)
```csharp
public double GetBarModelDiameter()
```

## Returns
Returns the model diameter of the Rebar.